Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 28, 28, 64)        3200      
_________________________________________________________________
batch_normalization (BatchNo (None, 28, 28, 64)        256       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 7, 7, 64)          0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 7, 7, 128)         204928    
_________________________________________________________________
dropout (Dropout)            (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 64)          204864    
_________________________________________________________________
dropout_1 (Dropout)          (None, 7, 7, 64)          0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 7, 7, 64)          102464    
_________________________________________________________________
dropout_2 (Dropout)          (None, 7, 7, 64)          0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 32)          100384    
_________________________________________________________________
dropout_3 (Dropout)          (None, 7, 7, 32)          0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 128)         102528    
_________________________________________________________________
dropout_4 (Dropout)          (None, 7, 7, 128)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 7, 7, 64)          204864    
_________________________________________________________________
global_average_pooling2d (Gl (None, 64)                0         
_________________________________________________________________
dense (Dense)                (None, 10)                650       
=================================================================
Total params: 924,138
Trainable params: 924,010
Non-trainable params: 128
_________________________________________________________________
None
batch size: [20]	learning rate: 0.001	max epochs: 350


items/class:  10  patience:  100
             precision recall  f1-score  support
0                0.855  0.931     0.891      980
1                0.975  0.936     0.955     1135
2                0.796  0.688     0.738     1032
3                0.731  0.898     0.806     1010
4                0.814  0.872     0.842      982
5                0.505  0.414     0.455      892
6                0.911  0.831     0.869      958
7                0.879  0.907     0.893     1028
8                0.704  0.625     0.662      974
9                0.701  0.785     0.741     1009
accuracy             -      -     0.794    10000
macro avg        0.787  0.789     0.785    10000
weighted avg     0.792  0.794     0.791    10000
mcc:  0.772
last epoch:  277

