Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 32, 128)       6400      
_________________________________________________________________
batch_normalization (BatchNo (None, 32, 32, 128)       512       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          204864    
_________________________________________________________________
batch_normalization_1 (Batch (None, 8, 8, 64)          256       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 32)          18464     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 2, 2, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                4128      
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
dense_2 (Dense)              (None, 102)               3366      
=================================================================
Total params: 239,046
Trainable params: 238,662
Non-trainable params: 384
_________________________________________________________________
None
batch size: [20]	learning rate: 0.0001	max epochs: 80


items/class:  10  patience:  55
             precision recall  f1-score  support
0                0.005   0.05     0.009       20
1                0.667   0.35     0.459       40
2                    0      0     0.000       20
3                0.016  0.028     0.021       36
4                    0      0     0.000       45
...                ...    ...       ...      ...
100              0.118  0.053     0.073       38
101               0.03  0.036     0.033       28
accuracy             -      -     0.047     6149
macro avg        0.067  0.052     0.048     6149
weighted avg      0.07  0.047     0.048     6149

[105 rows x 4 columns]
mcc:  0.036
last epoch:  74

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 32, 128)       6400      
_________________________________________________________________
batch_normalization (BatchNo (None, 32, 32, 128)       512       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          204864    
_________________________________________________________________
batch_normalization_1 (Batch (None, 8, 8, 64)          256       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 32)          18464     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 2, 2, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                4128      
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
dense_2 (Dense)              (None, 102)               3366      
=================================================================
Total params: 239,046
Trainable params: 238,662
Non-trainable params: 384
_________________________________________________________________
None
batch size: [20]	learning rate: 5e-05	max epochs: 300


items/class:  10  patience:  55
             precision recall  f1-score  support
0                0.009   0.05     0.016       20
1                0.517  0.375     0.435       40
2                    0      0     0.000       20
3                0.022  0.056     0.031       36
4                0.014  0.022     0.017       45
...                ...    ...       ...      ...
100              0.095  0.053     0.068       38
101              0.013  0.036     0.019       28
accuracy             -      -     0.041     6149
macro avg        0.043  0.043     0.037     6149
weighted avg      0.05  0.041     0.039     6149

[105 rows x 4 columns]
mcc:  0.032
last epoch:  67

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 32, 128)       6400      
_________________________________________________________________
batch_normalization (BatchNo (None, 32, 32, 128)       512       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          204864    
_________________________________________________________________
batch_normalization_1 (Batch (None, 8, 8, 64)          256       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 32)          18464     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 2, 2, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                4128      
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
dense_2 (Dense)              (None, 102)               3366      
=================================================================
Total params: 239,046
Trainable params: 238,662
Non-trainable params: 384
_________________________________________________________________
None
batch size: [20]	learning rate: 0.0001	max epochs: 300


items/class:  10  patience:  155
             precision recall  f1-score  support
0                    0      0     0.000       20
1                0.447  0.425     0.436       40
2                    0      0     0.000       20
3                0.018  0.028     0.022       36
4                    0      0     0.000       45
...                ...    ...       ...      ...
100              0.082  0.105     0.092       38
101              0.023  0.071     0.034       28
accuracy             -      -     0.053     6149
macro avg        0.055  0.057     0.051     6149
weighted avg     0.064  0.053     0.053     6149

[105 rows x 4 columns]
mcc:  0.043
last epoch:  174

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 32, 128)       6400      
_________________________________________________________________
batch_normalization (BatchNo (None, 32, 32, 128)       512       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          204864    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 32)          18464     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 2, 2, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                4128      
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
dense_2 (Dense)              (None, 102)               3366      
=================================================================
Total params: 238,790
Trainable params: 238,534
Non-trainable params: 256
_________________________________________________________________
None
batch size: [32]	learning rate: 0.0001	max epochs: 300


items/class:  10  patience:  155
             precision recall  f1-score  support
0                    0      0     0.000       20
1                0.568  0.525     0.545       40
2                0.009   0.05     0.015       20
3                    0      0     0.000       36
4                0.067  0.044     0.053       45
...                ...    ...       ...      ...
100              0.025  0.053     0.034       38
101                  0      0     0.000       28
accuracy             -      -     0.054     6149
macro avg        0.054  0.058     0.051     6149
weighted avg     0.062  0.054     0.052     6149

[105 rows x 4 columns]
mcc:  0.044
last epoch:  177

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 32, 128)       6400      
_________________________________________________________________
batch_normalization (BatchNo (None, 32, 32, 128)       512       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          204864    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 32)          18464     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 2, 2, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                4128      
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
dense_2 (Dense)              (None, 102)               3366      
=================================================================
Total params: 238,790
Trainable params: 238,534
Non-trainable params: 256
_________________________________________________________________
None
batch size: [128]	learning rate: 0.0001	max epochs: 300


items/class:  10  patience:  255
             precision recall  f1-score  support
0                    0      0     0.000       20
1                0.263  0.375     0.309       40
2                    0      0     0.000       20
3                    0      0     0.000       36
4                0.017  0.022     0.019       45
...                ...    ...       ...      ...
100                  0      0     0.000       38
101               0.01  0.036     0.016       28
accuracy             -      -     0.051     6149
macro avg        0.051   0.05     0.046     6149
weighted avg     0.064  0.051     0.051     6149

[105 rows x 4 columns]
mcc:  0.042
last epoch:  300

