Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 32, 128)       6400      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          204864    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 32)          18464     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 2, 2, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                4128      
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 102)               3366      
=================================================================
Total params: 238,278
Trainable params: 238,278
Non-trainable params: 0
_________________________________________________________________
None
batch size: [20]	learning rate: 0.0001	max epochs: 80


items/class:  10  patience:  55
             precision recall  f1-score  support
0                    0      0     0.000       20
1                0.036    0.2     0.061       40
2                    0      0     0.000       20
3                    0      0     0.000       36
4                    0      0     0.000       45
...                ...    ...       ...      ...
100                  0      0     0.000       38
101                  0      0     0.000       28
accuracy             -      -     0.010     6149
macro avg        0.006  0.014     0.002     6149
weighted avg     0.008   0.01     0.002     6149

[105 rows x 4 columns]
mcc:  -0.001
last epoch:  80

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 32, 128)       6400      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          204864    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 32)          18464     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 2, 2, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                4128      
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 102)               3366      
=================================================================
Total params: 238,278
Trainable params: 238,278
Non-trainable params: 0
_________________________________________________________________
None
batch size: [20]	learning rate: 5e-05	max epochs: 300


items/class:  10  patience:  55
             precision recall  f1-score  support
0                    0      0     0.000       20
1                0.038  0.725     0.072       40
2                    0      0     0.000       20
3                    0      0     0.000       36
4                    0      0     0.000       45
...                ...    ...       ...      ...
100                  0      0     0.000       38
101                  0      0     0.000       28
accuracy             -      -     0.020     6149
macro avg        0.007  0.031     0.007     6149
weighted avg     0.009   0.02     0.007     6149

[105 rows x 4 columns]
mcc:  0.016
last epoch:  300

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 32, 128)       6400      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          204864    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 32)          18464     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 2, 2, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                4128      
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 102)               3366      
=================================================================
Total params: 238,278
Trainable params: 238,278
Non-trainable params: 0
_________________________________________________________________
None
batch size: [20]	learning rate: 5e-05	max epochs: 600


items/class:  10  patience:  55
             precision recall  f1-score  support
0                    0      0     0.000       20
1                0.077  0.675     0.139       40
2                    0      0     0.000       20
3                  0.5  0.056     0.100       36
4                    0      0     0.000       45
...                ...    ...       ...      ...
100                  0      0     0.000       38
101                  0      0     0.000       28
accuracy             -      -     0.039     6149
macro avg        0.032  0.048     0.023     6149
weighted avg     0.038  0.039     0.024     6149

[105 rows x 4 columns]
mcc:  0.033
last epoch:  600

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 32, 128)       6400      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          204864    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 32)          18464     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 2, 2, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                4128      
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 102)               3366      
=================================================================
Total params: 238,278
Trainable params: 238,278
Non-trainable params: 0
_________________________________________________________________
None
batch size: [32]	learning rate: 5e-05	max epochs: 600


items/class:  10  patience:  55
             precision recall  f1-score  support
0                    0      0     0.000       20
1                 0.12   0.75     0.208       40
2                    0      0     0.000       20
3                    0      0     0.000       36
4                    0      0     0.000       45
...                ...    ...       ...      ...
100              0.026  0.026     0.026       38
101                  0      0     0.000       28
accuracy             -      -     0.028     6149
macro avg        0.016  0.044     0.014     6149
weighted avg     0.016  0.028     0.012     6149

[105 rows x 4 columns]
mcc:  0.023
last epoch:  600

Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 32, 32, 128)       6400      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 64)          204864    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 32)          18464     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 2, 2, 32)          0         
_________________________________________________________________
flatten (Flatten)            (None, 128)               0         
_________________________________________________________________
dropout (Dropout)            (None, 128)               0         
_________________________________________________________________
dense (Dense)                (None, 32)                4128      
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 102)               3366      
=================================================================
Total params: 238,278
Trainable params: 238,278
Non-trainable params: 0
_________________________________________________________________
None
batch size: [20]	learning rate: 0.0001	max epochs: 600


items/class:  10  patience:  55
             precision recall  f1-score  support
0                0.042   0.05     0.045       20
1                0.082   0.75     0.148       40
2                    0      0     0.000       20
3                    0      0     0.000       36
4                0.032  0.022     0.026       45
...                ...    ...       ...      ...
100                  0      0     0.000       38
101                  0      0     0.000       28
accuracy             -      -     0.033     6149
macro avg         0.02  0.046     0.018     6149
weighted avg     0.023  0.033     0.016     6149

[105 rows x 4 columns]
mcc:  0.028
last epoch:  361

